#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.root_ca_key: Refreshing state... [id=d3d73abbfee130be7cc079f6f9706c8062c4456c]
tls_private_key.local_client: Refreshing state... [id=8ce6f1d5331caf0160eb80bf89cea3cedc35d9da]
local_sensitive_file.local_client_key_pem: Refreshing state... [id=1681f626be4c9d0ebfe91022744196a46de6e4a9]
tls_cert_request.local_client: Refreshing state... [id=2aabe167e8738e8afcf147f54c65410ddb0d2e7a]
local_sensitive_file.root_ca_key_pem: Refreshing state... [id=9491f88cef3b3c00e4a3b8957016200fd76f6044]
tls_self_signed_cert.root_ca_cert: Refreshing state... [id=104180849855050035151034554151603476226]
tls_locally_signed_cert.local_client: Refreshing state... [id=27170574472903797391913114385013836962]
local_sensitive_file.root_ca_cert_pem: Refreshing state... [id=9f623a17ccb6f157dd6db34ebf28677e020d4e23]
data.tls_certificate.root_ca_cert_pem: Reading...
data.tls_certificate.root_ca_cert_pem: Read complete after 0s [id=cc071403a6ee1e17859ac728fac03d2047236392]
local_sensitive_file.local_client_cert_pem: Refreshing state... [id=3b70fa89a443349b794e5fcd453235f3fb844dac]
data.tls_certificate.local_client: Reading...
data.tls_certificate.local_client: Read complete after 0s [id=aabc414926645d9f1e4b79e667e568e1402e25bf]
data.azurerm_resource_group.this: Reading...
module.aio_full.data.azurerm_resource_group.this: Reading...
module.aio_full.data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021]
module.aio_full.data.azurerm_key_vault.aio_kv: Reading...
module.aio_full.azurerm_arc_kubernetes_cluster_extension.aio: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/azure-iot-operations]
module.aio_full.data.azurerm_key_vault.aio_kv: Read complete after 0s [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.KeyVault/vaults/kv-awg-aio-021]
data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021]
azapi_resource.egmq: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021]
azapi_resource.event_grid_local_client: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021/clients/local-client]
azapi_resource.egmq_topic_spaces: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021/topicSpaces/aio]
azapi_resource.event_grid_permission_binding_publisher: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021/permissionBindings/aio-publisher]
azapi_resource.egmq_permission_bindings_subscriber: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021/permissionBindings/aio-subscriber]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.akri[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/akri]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.layered_networking[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/layered-networking]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.mq[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/mq]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.assets[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/assets]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.processor[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/processor]
azurerm_role_assignment.aio_mq_eg_topicspaces_subscriber: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021/topicSpaces/aio/providers/Microsoft.Authorization/roleAssignments/97e7c650-44f3-c6d6-adc1-2299680158dd]
azurerm_role_assignment.aio_mq_eg_topicspaces_publisher: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.EventGrid/namespaces/eg-awg-aio-021/topicSpaces/aio/providers/Microsoft.Authorization/roleAssignments/ac82d424-348e-4c4c-5052-28fe36533ffb]
module.aio_full.azapi_resource.aio_custom_locations: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.ExtendedLocation/customLocations/cl-awg-aio-021-aio]
module.aio_full.azapi_resource.aio_custom_locations_sync: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.ExtendedLocation/customLocations/cl-awg-aio-021-aio/resourceSyncRules/cl-awg-aio-021-aio-sync]
module.aio_full.azapi_resource.processor_custom_locations_sync[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.ExtendedLocation/customLocations/cl-awg-aio-021-aio/resourceSyncRules/cl-awg-aio-021-aio-dp-sync]
module.aio_full.azapi_resource.aio_targets_main: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/awg-aio-021-tgt-main]
module.aio_full.azapi_resource.aio_targets_mq[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/awg-aio-021-tgt-mq]
module.aio_full.azapi_resource.mq_custom_locations_sync[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.ExtendedLocation/customLocations/cl-awg-aio-021-aio/resourceSyncRules/cl-awg-aio-021-aio-mq-sync]
module.aio_full.azapi_resource.processor_instances[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsDataProcessor/instances/dp-awg-aio-021]
module.aio_full.azapi_resource.adr_custom_locations_sync[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.ExtendedLocation/customLocations/cl-awg-aio-021-aio/resourceSyncRules/cl-awg-aio-021-aio-adr-sync]
module.aio_full.azapi_resource.mq[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsMQ/mq/mq-awg-aio-021]
module.aio_full.azapi_resource.aio_targets_opc_ua_broker_trust[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/awg-aio-021-tgt-oub-trust]
module.aio_full.azapi_resource.aio_targets_opc_ua_broker[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/awg-aio-021-tgt-oub]
module.aio_full.azapi_resource.mq_broker[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsMQ/mq/mq-awg-aio-021/broker/mq-awg-aio-021-bk]
module.aio_full.azapi_resource.mq_diagnostics[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsMQ/mq/mq-awg-aio-021/diagnosticService/mq-awg-aio-021-dia]
module.aio_full.azurerm_arc_kubernetes_cluster_extension.opc_ua_broker[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.Kubernetes/connectedClusters/arc-awg-aio-021/providers/Microsoft.KubernetesConfiguration/extensions/opc-ua-broker]
module.aio_full.azapi_resource.mq_broker_listener[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsMQ/mq/mq-awg-aio-021/broker/mq-awg-aio-021-bk/listener/mq-awg-aio-021-bk-lis]
module.aio_full.azapi_resource.mq_broker_auth[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsMQ/mq/mq-awg-aio-021/broker/mq-awg-aio-021-bk/authentication/mq-awg-aio-021-bk-aut]
module.opc_plc_sim.data.azurerm_resource_group.this: Reading...
module.opc_plc_sim.data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021]
module.opc_plc_sim.azapi_resource.aio_targets_opc_plc_sim[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/awg-aio-021-tgt-sim]
module.opc_plc_sim.azapi_resource.aio_targets_mqtt_client[0]: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/awg-aio-021-tgt-mc]
module.opc_plc_sim.azapi_resource.opc_sim_aep: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.DeviceRegistry/assetEndpointProfiles/opc-sim-connector]
module.opc_plc_sim.azapi_resource.opc_sim_asset: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.DeviceRegistry/assets/thermostat]
azapi_resource.aio_targets_cluster: Refreshing state... [id=/subscriptions/f792ffed-5ee6-41bf-84d2-7832d09ba988/resourceGroups/rg-awg-aio-021/providers/Microsoft.IoTOperationsOrchestrator/targets/cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.local_client_cert_pem will be created
  + resource "local_sensitive_file" "local_client_cert_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localca.pem"
      + id                   = (known after apply)
    }

  # local_sensitive_file.local_client_key_pem will be created
  + resource "local_sensitive_file" "local_client_key_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localca.key"
      + id                   = (known after apply)
    }

  # local_sensitive_file.root_ca_cert_pem will be created
  + resource "local_sensitive_file" "root_ca_cert_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localrootca.pem"
      + id                   = (known after apply)
    }

  # local_sensitive_file.root_ca_key_pem will be created
  + resource "local_sensitive_file" "root_ca_key_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../out/localrootca.key"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @agreaves-ms, Action: `pull_request`, Working Directory: ``, Workflow: `CI Pull Request`*